# Є 2 списки:
lst_1 = [1, 2, 5, 7, 9, 99, 87, 200, 39, 2]
lst_2 = [5, 42, 29, 345, 50, 33, 7, 0, 201, 9, 2, 132, 45, 23, 934]
# Порахувати скільки разів числа з одного списку зустрічаються в іншому списку.
# Вивести у вигляді відформатованої таблиці.

lst_1_in_2 = [lst_2.count(lst_1[i]) for i in range(len(lst_1))]
lst_2_in_1 = [lst_1.count(lst_2[i]) for i in range(len(lst_2))]
line = "-" * 59
print(line)
print(f'|{"Эл.списка":^12}|{"К-во найденных":^15}|{"Эл.списка":^12}|{"К-во найденных":^15}|')
print(f'|{"№1":^12}|{"повторов в №2":^15}|{"№2":^12}|{"повторов в №1":^15}|')
print(line)
for i in range(len(lst_1)):
    print(f'|{lst_1[i]:^12}|{lst_1_in_2[i]:^15}|{lst_2[i]:^12}|{lst_2_in_1[i]:^15}|')
for i in range(len(lst_1), len(lst_2)):
    print(f'|{"-":^12}|{"-":^15}|{lst_2[i]:^12}|{lst_2_in_1[i]:^15}|')
print(line)
