# in_str = "Есть1много вариантов Lorem Ipsum, но большинство из них имеет не всегда приемлемые модификация"
in_str = input("Введіть рядок більше 15 символів")

print("a.виведіть третій символ цього рядка.\n", in_str[2])
print("b.виведіть передостанній символ цього рядка.\n", in_str[-2])
print("c.виведіть перші п'ять символів цього рядка.\n", in_str[0:5])
print("d.виведіть весь рядок, крім двох останніх символів.\n", in_str[0:len(in_str)-2])
print("e.виведіть усі символи з парними індексами(вважаючи, що індексація починається\n"
      "з 0, тому символи виводяться починаючи з першого).\n", in_str[0::2])
print("f.виведіть усі символи з непарними індексами, тобто, починаючи\n"
      "з другого символу рядка.\n", in_str[1::2])
print("g.виведіть усі символи у зворотному порядку.\n", in_str[::-1])
print("h.виведіть усі символи рядка через один у зворотному порядку,\n" 
      "починаючи з останнього. i.виведіть довжину цього рядка.\n", in_str[::-2], "\n", len(in_str[::-2]))
