# 1 Пишемо кредитний калькулятор:
#
# Потрібен кредитний калькулятор який може прорахувати виплати які потрібно робити клієнту кожного місяця
# для погашення всього кредиту. Кредит береться клієнтом в уставнові під певний процент - 2% в місяць
# перші 2 роки та 4% в місяць наступні роки. Процент нараховується що місяця на остачу що залишилaся після виплати.
#
# Програма запитує суму кредиту у клієнта.
#
# Вивести помісячно суму яку потрібно пратити клєнту щоб розрахуватися з кредитом за 1, за 5 років.
#
# Очікується що вивід буде оформлений в у вигляді симетрично відофрматованих стовбців.
#
# Повино бути присутнім у виводі інформаціі - номер місяця, сума виплати за місяць, та скільки процентів
# нараховано за місяць.
pereplata = 0
summa_kredita = int(input("Введите сумму кредита :\n"))
srok = int(input("срок кредита 1 или 5\n"))
telo_v_mesyac_1 = summa_kredita / 12
telo_v_mesyac_5 = summa_kredita / 60
ostatok = summa_kredita
line = "-" * 56
print(line)
print(f'|{"Месяц":^11}|{"Платеж":^14}|{"Процент":^13}|{"Остаток":^13}|')
print(line)

for i in (range(1, 13) if srok == 1 else range(1, 61)):
    procent = 0.02 * ostatok if i <= 24 else 0.04 * ostatok
    ostatok = ostatok - telo_v_mesyac_1 if srok == 1 else ostatok - telo_v_mesyac_5
    platej = procent + telo_v_mesyac_1 if srok == 1 else procent + telo_v_mesyac_5
    print(f'|{i:^11}|{platej:^14.2f}|{procent:^13.2f}|{ostatok:^13.2f}|')
    pereplata += procent
print(line)
print(f'|{"Переплата":^11}|{pereplata:^14.2f}|{"":^27}|')
print(line)
